backend/controllers/PostsController.php

    protected function findModel($id)
    {
        if (($model = Posts::findOne($id)) !== null) {
---
SELECT * FROM `posts` WHERE `id`='1'