common/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE, 'role' => self::ADMIN]); // добавить role
---
SELECT * FROM `user` WHERE (`username`='igor') AND (`status`=10) AND (`role`='admin')

    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email]);
---
SELECT * FROM `user` WHERE `email`='makarev-igor-1987@yandex.ru'