backend/views/posts/_form.php

SELECT * FROM `categories`
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'id_category')->dropdownList(ArrayHelper::map(Categories::find()->all(), 'id', 'title_category')) ?>