frontend/views/site/post.php

SELECT * FROM `categories`
---
        <div class="col-lg-5">
            <?php $form = ActiveForm::begin(['id' => 'post-form']); ?>

            <?= $form->field($modelPost, 'id_category')->dropdownList(ArrayHelper::map(Categories::find()->all(), 'id', 'title_category')) ?>